       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOV1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY "MEU PRIMEIRO PROGRAMA".
